## dev: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 4 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| update   | `aws_acmpca_certificate_authority.client_vpn`                  |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s` |
|          | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`       |
|          | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`     |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acmpca_certificate_authority.client_vpn will be updated in-place
  ~ resource "aws_acmpca_certificate_authority" "client_vpn" {
        id                              = "arn:aws:acm-pca:ca-central-1:800095993820:certificate-authority/f0d417c3-6bf1-470c-ad08-302f633a1667"
      ~ permanent_deletion_time_in_days = 30 -> 7
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-dev-eks-cluster:notification-canada-ca-dev-eks-primary-node-group-k8s"
      ~ release_version        = "1.30.2-20240828" -> "1.30.2-20240904"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-dev"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-dev-eks-cluster"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:800095993820:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          + custom_time_zone    = "UTC"
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:EKS_KARPENTER_AMI_ID-qn3fs3" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:EKS_KARPENTER_AMI_ID-qn3fs3|terraform-20240904133326131700000001" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240904133326131700000001" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRoleWithWebIdentity" -> [
                          + "sts:TagSession",
                          + "sts:AssumeRoleWithWebIdentity",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "karpenter-controller-eks"
        name                  = "karpenter-controller-eks"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_ec2_managed_prefix_list.google_cidrs"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.coredns"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.ebs_driver"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.kube_proxy"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.vpc_cni"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_cluster.notification-canada-ca-eks-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_node_group.notification-canada-ca-eks-node-group-k8s"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_instance_profile.karpenter"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
